takanobuyamaoka/ra6m5/RA6M5-1.0.0/cores/RA6M5/arduino/core/wiring_analog.c
/*
  wiring_analog.c - analog input and output
  Part of Arduino - http://www.arduino.cc/

  Copyright (c) 2005-2006 David A. Mellis

  This library is free software; you can redistribute it and/or
  modify it under the terms of the GNU Lesser General Public
  License as published by the Free Software Foundation; either
  version 2.1 of the License, or (at your option) any later version.

  This library is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
  Lesser General Public License for more details.

  You should have received a copy of the GNU Lesser General
  Public License along with this library; if not, write to the
  Free Software Foundation, Inc., 59 Temple Place, Suite 330,
  Boston, MA  02111-1307  USA

  Modified 28 September 2010 by Mark Sproul
*/

#include "wiring_private.h"
#include "pins_arduino.h"

#ifdef _RA6M5_
#include "bsp_api.h"
#include "hal_data.h"
const adc_channel_t mPintoAPin[] = {
    ADC_CHANNEL_0,  // A0
    ADC_CHANNEL_1,  // A1
    ADC_CHANNEL_2,  // A2
    ADC_CHANNEL_3,  // A3
    ADC_CHANNEL_12, // A4
    ADC_CHANNEL_13, // A5
};
typedef struct {
    bool begin;
    gpt_instance_ctrl_t* gpt_ctrl;
    const timer_cfg_t* gpt_cfg;
    gpt_io_pin_t gpt_pin;
    bsp_io_port_pin_t    pin;
} pwmTable_t;
static pwmTable_t pwmTable[] = {
     {false, NULL, NULL, 0, 0}, // D0
     {false, NULL, NULL, 0, 0}, // D1
     {false, NULL, NULL, 0, 0}, // D2
     {false, &g_timer3_ctrl, &g_timer3_cfg, GPT_IO_PIN_GTIOCA, BSP_IO_PORT_01_PIN_11}, // D3
     {false, NULL, NULL, 0, 0}, // D4
     {false, &g_timer1_ctrl, &g_timer1_cfg, GPT_IO_PIN_GTIOCB, BSP_IO_PORT_04_PIN_06}, // D5
     {false, &g_timer8_ctrl, &g_timer8_cfg, GPT_IO_PIN_GTIOCB, BSP_IO_PORT_01_PIN_07}, // D6
     {false, NULL, NULL, 0, 0}, // D7
     {false, NULL, NULL, 0, 0}, // D8
     {false, &g_timer2_ctrl, &g_timer2_cfg, GPT_IO_PIN_GTIOCB, BSP_IO_PORT_01_PIN_14}, // D9
     {false, &g_timer4_ctrl, &g_timer4_cfg, GPT_IO_PIN_GTIOCB, BSP_IO_PORT_03_PIN_01}, // D10
     {false, &g_timer7_ctrl, &g_timer7_cfg, GPT_IO_PIN_GTIOCB, BSP_IO_PORT_06_PIN_02}, // D11
     {false, NULL, NULL, 0, 0}, // D12
     {false, NULL, NULL, 0, 0}, // D13
};

static ioport_instance_ctrl_t _ioport_ctrl;
static ioport_pin_cfg_t _pin_cfg_data;
static const ioport_cfg_t _pin_cfg = { .number_of_pins = 1, .p_pin_cfg_data = &_pin_cfg_data };
#endif

uint8_t analog_reference = DEFAULT;

void analogReference(uint8_t mode)
{
	// can't actually set the register here because the default setting
	// will connect AVCC and the AREF pin, which would cause a short if
	// there's something connected to AREF.
	analog_reference = mode;
}

int analogRead(uint8_t pin)
{
#ifndef _RA6M5_
	uint8_t low, high;

#if defined(analogPinToChannel)
#if defined(__AVR_ATmega32U4__)
	if (pin >= 18) pin -= 18; // allow for channel or pin numbers
#endif
	pin = analogPinToChannel(pin);
#elif defined(__AVR_ATmega1280__) || defined(__AVR_ATmega2560__)
	if (pin >= 54) pin -= 54; // allow for channel or pin numbers
#elif defined(__AVR_ATmega32U4__)
	if (pin >= 18) pin -= 18; // allow for channel or pin numbers
#elif defined(__AVR_ATmega1284__) || defined(__AVR_ATmega1284P__) || defined(__AVR_ATmega644__) || defined(__AVR_ATmega644A__) || defined(__AVR_ATmega644P__) || defined(__AVR_ATmega644PA__)
	if (pin >= 24) pin -= 24; // allow for channel or pin numbers
#else
	if (pin >= 14) pin -= 14; // allow for channel or pin numbers
#endif

#if defined(ADCSRB) && defined(MUX5)
	// the MUX5 bit of ADCSRB selects whether we're reading from channels
	// 0 to 7 (MUX5 low) or 8 to 15 (MUX5 high).
	ADCSRB = (ADCSRB & ~(1 << MUX5)) | (((pin >> 3) & 0x01) << MUX5);
#endif
  
	// set the analog reference (high two bits of ADMUX) and select the
	// channel (low 4 bits).  this also sets ADLAR (left-adjust result)
	// to 0 (the default).
#if defined(ADMUX)
#if defined(__AVR_ATtiny25__) || defined(__AVR_ATtiny45__) || defined(__AVR_ATtiny85__)
	ADMUX = (analog_reference << 4) | (pin & 0x07);
#else
	ADMUX = (analog_reference << 6) | (pin & 0x07);
#endif
#endif

	// without a delay, we seem to read from the wrong channel
	//delay(1);

#if defined(ADCSRA) && defined(ADCL)
	// start the conversion
	sbi(ADCSRA, ADSC);

	// ADSC is cleared when the conversion finishes
	while (bit_is_set(ADCSRA, ADSC));

	// we have to read ADCL first; doing so locks both ADCL
	// and ADCH until ADCH is read.  reading ADCL second would
	// cause the results of each conversion to be discarded,
	// as ADCL and ADCH would be locked when it completed.
	low  = ADCL;
	high = ADCH;
#else
	// we dont have an ADC, return 0
	low  = 0;
	high = 0;
#endif

	// combine the two bytes
	return (high << 8) | low;
#else
	static bool begin = false;

	if(begin == false)
	{
	    if (R_ADC_Open(&g_adc0_ctrl, &g_adc0_cfg) != FSP_SUCCESS) while(1);
	    if (R_ADC_ScanCfg(&g_adc0_ctrl, &g_adc0_channel_cfg) != FSP_SUCCESS) while(1);
	    begin = true;
	}

    (void) R_ADC_ScanStart(&g_adc0_ctrl);
    adc_status_t status;
    status.state = ADC_STATE_SCAN_IN_PROGRESS;
    while (ADC_STATE_SCAN_IN_PROGRESS == status.state)
    {
        (void) R_ADC_StatusGet(&g_adc0_ctrl, &status);
    }

    uint16_t result;
    R_ADC_Read(&g_adc0_ctrl, mPintoAPin[pin - A0], &result);
    return (int)(result >> 2);	// 12bit → 10bit変換

#endif
}

// Right now, PWM output only works on the pins with
// hardware support.  These are defined in the appropriate
// pins_*.c file.  For the rest of the pins, we default
// to digital output.
void analogWrite(uint8_t pin, int val)
{
	// We need to make sure the PWM output is enabled for those pins
	// that support it, as we turn it off when digitally reading or
	// writing with them.  Also, make sure the pin is in output mode
	// for consistenty with Wiring, which doesn't require a pinMode
	// call for the analog output pins.

	// FIXME: GPIOに設定してしまうとPWMが動かなくなるので一旦コメントアウト
//	if (val == 0)
//	{
//        (void) R_GPT_Close(pwmTable[pin].gpt_ctrl);
//		pinMode(pin, OUTPUT);
//		digitalWrite(pin, LOW);
//		pwmTable[pin].begin = false;
//	}
//	else if (val == 255)
//	{
//        (void) R_GPT_Close(pwmTable[pin].gpt_ctrl);
//		pinMode(pin, OUTPUT);
//		digitalWrite(pin, HIGH);
//		pwmTable[pin].begin = false;
//	}
//	else
//	{
#ifndef _RA6M5_
		switch(digitalPinToTimer(pin))
		{
			// XXX fix needed for atmega8
			#if defined(TCCR0) && defined(COM00) && !defined(__AVR_ATmega8__)
			case TIMER0A:
				// connect pwm to pin on timer 0
				sbi(TCCR0, COM00);
				OCR0 = val; // set pwm duty
				break;
			#endif

			#if defined(TCCR0A) && defined(COM0A1)
			case TIMER0A:
				// connect pwm to pin on timer 0, channel A
				sbi(TCCR0A, COM0A1);
				OCR0A = val; // set pwm duty
				break;
			#endif

			#if defined(TCCR0A) && defined(COM0B1)
			case TIMER0B:
				// connect pwm to pin on timer 0, channel B
				sbi(TCCR0A, COM0B1);
				OCR0B = val; // set pwm duty
				break;
			#endif

			#if defined(TCCR1A) && defined(COM1A1)
			case TIMER1A:
				// connect pwm to pin on timer 1, channel A
				sbi(TCCR1A, COM1A1);
				OCR1A = val; // set pwm duty
				break;
			#endif

			#if defined(TCCR1A) && defined(COM1B1)
			case TIMER1B:
				// connect pwm to pin on timer 1, channel B
				sbi(TCCR1A, COM1B1);
				OCR1B = val; // set pwm duty
				break;
			#endif

			#if defined(TCCR1A) && defined(COM1C1)
			case TIMER1C:
				// connect pwm to pin on timer 1, channel B
				sbi(TCCR1A, COM1C1);
				OCR1C = val; // set pwm duty
				break;
			#endif

			#if defined(TCCR2) && defined(COM21)
			case TIMER2:
				// connect pwm to pin on timer 2
				sbi(TCCR2, COM21);
				OCR2 = val; // set pwm duty
				break;
			#endif

			#if defined(TCCR2A) && defined(COM2A1)
			case TIMER2A:
				// connect pwm to pin on timer 2, channel A
				sbi(TCCR2A, COM2A1);
				OCR2A = val; // set pwm duty
				break;
			#endif

			#if defined(TCCR2A) && defined(COM2B1)
			case TIMER2B:
				// connect pwm to pin on timer 2, channel B
				sbi(TCCR2A, COM2B1);
				OCR2B = val; // set pwm duty
				break;
			#endif

			#if defined(TCCR3A) && defined(COM3A1)
			case TIMER3A:
				// connect pwm to pin on timer 3, channel A
				sbi(TCCR3A, COM3A1);
				OCR3A = val; // set pwm duty
				break;
			#endif

			#if defined(TCCR3A) && defined(COM3B1)
			case TIMER3B:
				// connect pwm to pin on timer 3, channel B
				sbi(TCCR3A, COM3B1);
				OCR3B = val; // set pwm duty
				break;
			#endif

			#if defined(TCCR3A) && defined(COM3C1)
			case TIMER3C:
				// connect pwm to pin on timer 3, channel C
				sbi(TCCR3A, COM3C1);
				OCR3C = val; // set pwm duty
				break;
			#endif

			#if defined(TCCR4A)
			case TIMER4A:
				//connect pwm to pin on timer 4, channel A
				sbi(TCCR4A, COM4A1);
				#if defined(COM4A0)		// only used on 32U4
				cbi(TCCR4A, COM4A0);
				#endif
				OCR4A = val;	// set pwm duty
				break;
			#endif
			
			#if defined(TCCR4A) && defined(COM4B1)
			case TIMER4B:
				// connect pwm to pin on timer 4, channel B
				sbi(TCCR4A, COM4B1);
				OCR4B = val; // set pwm duty
				break;
			#endif

			#if defined(TCCR4A) && defined(COM4C1)
			case TIMER4C:
				// connect pwm to pin on timer 4, channel C
				sbi(TCCR4A, COM4C1);
				OCR4C = val; // set pwm duty
				break;
			#endif
				
			#if defined(TCCR4C) && defined(COM4D1)
			case TIMER4D:				
				// connect pwm to pin on timer 4, channel D
				sbi(TCCR4C, COM4D1);
				#if defined(COM4D0)		// only used on 32U4
				cbi(TCCR4C, COM4D0);
				#endif
				OCR4D = val;	// set pwm duty
				break;
			#endif

							
			#if defined(TCCR5A) && defined(COM5A1)
			case TIMER5A:
				// connect pwm to pin on timer 5, channel A
				sbi(TCCR5A, COM5A1);
				OCR5A = val; // set pwm duty
				break;
			#endif

			#if defined(TCCR5A) && defined(COM5B1)
			case TIMER5B:
				// connect pwm to pin on timer 5, channel B
				sbi(TCCR5A, COM5B1);
				OCR5B = val; // set pwm duty
				break;
			#endif

			#if defined(TCCR5A) && defined(COM5C1)
			case TIMER5C:
				// connect pwm to pin on timer 5, channel C
				sbi(TCCR5A, COM5C1);
				OCR5C = val; // set pwm duty
				break;
			#endif

			case NOT_ON_TIMER:
			default:
				if (val < 128) {
					digitalWrite(pin, LOW);
				} else {
					digitalWrite(pin, HIGH);
				}
		}
#else

	    if(pwmTable[pin].begin == false)
	    {
	    	_pin_cfg_data.pin_cfg = ((uint32_t) IOPORT_CFG_PERIPHERAL_PIN | (uint32_t) IOPORT_PERIPHERAL_GPT1);
	        _pin_cfg_data.pin = pwmTable[pin].pin;
	        R_IOPORT_Open(&_ioport_ctrl, &_pin_cfg);
	        R_IOPORT_Close(&_ioport_ctrl);

	        if (R_GPT_Open(pwmTable[pin].gpt_ctrl, pwmTable[pin].gpt_cfg) != FSP_SUCCESS) while(1);
	        (void) R_GPT_Start(pwmTable[pin].gpt_ctrl);
	        pwmTable[pin].begin = true;
	    }
	    timer_info_t info;
	    (void) R_GPT_InfoGet(pwmTable[pin].gpt_ctrl, &info);
	    uint32_t current_period_counts = info.period_counts;
	    uint32_t duty_cycle_counts = (uint32_t) (((uint64_t)current_period_counts * (uint64_t)val) / 255);
	    R_GPT_DutyCycleSet(pwmTable[pin].gpt_ctrl, duty_cycle_counts, pwmTable[pin].gpt_pin);
//	}

#endif
}

